Repository: yara9048/BetterConsultApp
Catalog: lib/l10n/intl_*.arb
Languages: ar

# title1
source: Welcome to Better Consult
ar: مرحباً بك في Better Consult

# description1
source: Your trusted partner for smart and secure consultations.
ar: شريكك الموثوق للاستشارات الذكية والآمنة.

# title2
source: Choose Your Expert
ar: اختر خبيرك

# description2
source: Get personalized advice from professionals you select.
ar: احصل على نصائح مخصصة من الخبراء الذين تختارهم.

# title3
source: Powered by AI
ar: مدعوم بالذكاء الاصطناعي

# description3
source: AI-enhanced features for a smarter, faster experience.
ar: ميزات محسّنة بالذكاء الاصطناعي لتجربة أسرع وأكثر ذكاءً.

# title4
source: Wide Range of Categories
ar: مجموعة واسعة من الفئات

# description4
source: Access consultations across health, finance, tech, and more.
ar: استفد من الاستشارات في مجالات الصحة والمال والتقنية والمزيد.

# title5
source: Your Privacy, Our Priority
ar: خصوصيتك أولويتنا

# description5
source: Advanced security ensures your data stays safe and confidential.
ar: أمان متقدم يضمن بقاء بياناتك آمنة وسرية.

source: Skip
ar: تخطي

source: Start
ar: ابدأ

# loginErrorSnackBar
source: Wrong login information
ar: بيانات تسجيل الدخول غير صحيحة

# loginWelcome1
source: Welcome Back!
ar: مرحباً بعودتك!

# loginWelcome2
source: login to our app to continue
ar: سجّل دخولك إلى تطبيقنا للمتابعة

source: Email
ar: البريد الإلكتروني

# emailHint
source: Enter your email
ar: ادخل بريدك الإلكتروني

# emailValidation1
source: Email mustn't be empty
ar: لا يمكن أن يكون البريد الإلكتروني فارغاً

# emailValidation2
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صحيح

source: Password
ar: كلمة المرور

# passwordHint
source: Enter your password
ar: ادخل كلمة المرور

# passwordValidation1
source: Password mustn't be empty
ar: لا يمكن أن تكون كلمة المرور فارغة

source: Login
ar: تسجيل الدخول

source: Sign up
ar: إنشاء حساب

# doforgetPassword
source: Forgot Password?
ar: هل نسيت كلمة المرور؟

# DontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# forgetPassword
source: Forgot Password
ar: نسيت كلمة المرور

# emailVerification1
source: Mail address here
ar: ادخل البريد الإلكتروني هنا

# emailVerification2
source: Enter the mail address associated
ar: ادخل البريد الإلكتروني المرتبط

# emailVerification3
source: with your account.
ar: بحسابك.

# emailValidation3
source: Please enter your email
ar: يرجى إدخال بريدك الإلكتروني

source: Send
ar: إرسال

# sendOTPSnackBar
source: OTP sent successfully! Check your email.
ar: تم إرسال رمز التحقق بنجاح! تحقق من بريدك الإلكتروني.

# sendOTPFailed
source: Invalid Email
ar: بريدك الالكتروني غير صالح

# OTPSuccess
source: Email Verified Successfully
ar: تم التحقق من البريد الإلكتروني بنجاح

# OTPFailed
source: OTP invalid
ar: رمز التحقق غير صحيح

source: Email Verification
ar: التحقق من البريد الإلكتروني

# OTP1
source: Get your Code
ar: احصل على رمزك

# OTP2
source: Please enter your 6 digit code that
ar: يرجى إدخال رمز التحقق المكوّن من 6 أرقام

# OTP3
source: was sent to your email address
ar: الذي تم إرساله إلى بريدك الإلكتروني

# OTPValidation
source: Please enter all 6 digits of the OTP
ar: يرجى إدخال جميع الأرقام الستة لرمز التحقق

# verifyAnsProceed
source: Verify and Proceed
ar: تحقق واستمر

source: Reset Password
ar: إعادة تعيين كلمة المرور

# resetSuccess
source: Password reset successfully! Please login.
ar: تمت إعادة تعيين كلمة المرور بنجاح! يرجى تسجيل الدخول.

# resetFailed
source: Password reset failed
ar: فشل في إعادة تعيين كلمة المرور

# reset1
source: Enter new password
ar: ادخل كلمة مرور جديدة

# reset2
source: Your new password should be different
ar: يجب أن تكون كلمة المرور الجديدة مختلفة

# reset3
source: from your previously used one
ar: عن التي استخدمتها سابقاً

# newPasswordHint
source: Enter your new password
ar: ادخل كلمة المرور الجديدة

# newPasswordValidation1
source: Please enter new password
ar: يرجى إدخال كلمة مرور جديدة

# newPasswordValidation2
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور مكونة من 6 أحرف على الأقل

# confirmPasswordHint
source: Confirm the password
ar: أعد إدخال كلمة المرور

# confirmPasswordValidation1
source: Please confirm your password
ar: يرجى تأكيد كلمة المرور

# confirmPasswordValidation2
source: Passwords do not match
ar: كلمات المرور غير متطابقة

# recover
source: Recover Password
ar: استعادة كلمة المرور

# confirmEmailReg1
source: In order to implement the registration
ar: من أجل إتمام عملية التسجيل

# confirmEmailReg2
source: process, we need to verify your email
ar: نحتاج إلى التحقق من بريدك الإلكتروني

# step1
source: Step 1 out of 3
ar: الخطوة 1 من 3

# step2
source: Step 2 out of 3
ar: الخطوة 2 من 3

# step3
source: Step 3 out of 3
ar: الخطوة 3 من 3

source: Send Code
ar: إرسال الرمز

source: Male
ar: ذكر

source: Female
ar: أنثى

# register1
source: Welcome!
ar: أهلاً بك!

# register2
source: Your email has verified successfully
ar: تم التحقق من بريدك الإلكتروني بنجاح

# register3
source: Please enter your personal information
ar: يرجى إدخال معلوماتك الشخصية

source: First name
ar: الاسم الأول

# firstNameHint
source: Please enter your first name
ar: يرجى إدخال اسمك الأول

# firstNameValidator
source: First name
ar: الاسم الأول مطلوب

# secondName
source: Last name
ar: اسم العائلة

# secondNameHint
source: Last name
ar: يرجى إدخال اسم العائلة

# secondNameValidator
source: Please enter your last name
ar: اسم العائلة مطلوب

source: Phone Number
ar: رقم الهاتف

# phoneNumberHint
source: Enter your phone number
ar: ادخل رقم هاتفك

# phoneNumberValidator
source: Please enter your phone number
ar: يرجى إدخال رقم الهاتف

source: Gender
ar: الجنس

# consultantJoin
source: Join us as Consultant
ar: انضم إلينا كاستشاري

source: Register
ar: تسجيل

# confirmpassword
source: Confirm your password
ar: اكد كلمة السر

source: Consultant Registration
ar: تسجيل المستشار

# consultantRegistration1
source: Let’s build your professional profile as a Consultant
ar: فلنبني ملفك الشخصي الاحترافي كمستشار

# field
source: Field / Industry
ar: المجال / القطاع

source: Specialization
ar: الاختصاص

# years
source: Years of Experience
ar: سنوات الخبرة

# presence
source: location
ar: الموقع

source: IndustryInformation
ar: مععلومات المجال

# location
source: Business Location
ar: مكان العمل

# about
source: About You
ar: عنك

# bio
source: Your Bio
ar: نبذة تعريفية

# languages
source: Spoken Languages
ar: اللغات المحكية

# files
source: Upload Files
ar: ارفع الملفات

# files1
source: Attach supporting documents that prove your expertise and consultancy credentials.
ar: ارفق الملفات التي تدعم كونك مستشار

source: Add
ar: اضف

# addError
source: No files uploaded yet
ar: لا ملفات مرفقة

source: Submit
ar: تأكيد

source: enter
ar: ادخل

source: Welcome
ar: مرحباً,

# welcome1
source: Let’s find the consultation you need
ar: لنبحث معًا عن الاستشارة التي تحتاجها

# searchHint
source: Search for your desired consultant
ar: ابحث عن المستشار الذي ترغب به

source: Categories
ar: الفئات

source: See All'
ar: عرض الكل

source: Home
ar: الرئيسية

source: Profile
ar: الملف الشخصي

# favorite
source: Favorites
ar: المفضلة

source: History
ar: السجل

source: Notifications
ar: الإشعارات

source: Preferences
ar: التفضيلات

# theme
source: Themes
ar: المظهر

source: Language
ar: اللغة

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

source: CANCEL
ar: إلغاء

source: Apply
ar: تطبيق

source: Confirm
ar: تأكيد

source: All Consultant
ar: جميع المستشارين

# generalChat1
source: Need help finding the right consultant?
ar: تحتاج مساعدة في العثور على المستشار المناسب؟

# generalChat2
source: Our team is available to assist you —
ar: فريقنا متاح لمساعدتك —

# generalChat3
source: start a chat
ar: ابدأ المحادثة

# generalChat4
source: for personalized recommendations.
ar: للحصول على استشارة شخصية

source: Consultant Details
ar: تفاصيل المستشار

source: About me
ar: نبذة عني

source: Chat with me
ar: تحدث معي

source: Chat History
ar: سجل المحادثات

source: Personal Information
ar: المعلومات الشخصية

source: Contact Details
ar: معلومات التواصل

source: fee
ar: التكلفة

source: Chat with Consultant
ar: محادثة مع المستشار

# chatHint
source: Type your message..
ar: اكتب رسالتك...

source: General Chat
ar: محادثة عامة

# switchToConsultant
source: Start Your Consultant Journey with us
ar: ابدأ رحلتك كمستشار معنا

source: Confirmation
ar: تأكيد

# confirmation1
source: By becoming a consultant, you will be able to share your experience,
ar: بانضمامك كمستشار، ستتمكن من مشاركة خبراتك،

# confirmation2
source: but also will be having higher responsibilities.
ar: ولكن سيكون عليك أيضًا مسؤوليات أكبر.

# confirmation3
source: However, this role requires dedication, professionalism,
ar: هذا الدور يتطلب الالتزام، والاحترافية،

# confirmation4
source: and consistent performance. Are you ready to take on these responsibilities?
ar: والأداء المستمر. هل أنت مستعد لتحمل هذه المسؤوليات؟

# welcomeCons
source: Let’s display some of the consultant that has been implemented
ar: لنعرِض بعض الاستشارات التي تمت بالفعل

source: Professional Information
ar: المعلومات المهنية

# addConsultant
source: Add a Consultation
ar: إضافة استشارة

# addConsultant1
source: Choose the consultation type then uploaded it
ar: اختر نوع الاستشارة ثم قم برفعها

source: Video
ar: فيديو

source: Voice
ar: صوت

source: Text
ar: نص

source: Settings
ar: اعدادات

# uploadValidationInvalid
source: Invalid file type. Please upload a
ar: نوع الملف غير صالح. يرجى رفع ملف من النوع

# uploadValidationNoneSelected
source: No file selected.
ar: لم يتم اختيار أي ملف.

# uploadValidationSuccess
source: uploaded successfully!
ar: تم الرفع بنجاح!

source: Upload your video
ar: قم برفع الفيديو الخاص بك

source: Upload Video
ar: رفع فيديو

# uploadVoice
source: Upload Audio
ar: رفع ملف صوتي

# uploadYourVoice
source: Upload your voice recording
ar: قم برفع تسجيلك الصوتي

# uploadText
source: Write your consultation text
ar: اكتب نص استشارتك

# uploadYourTextHint
source: Please enter your text consultation
ar: يرجى إدخال نص الاستشارة

source: Confirmed! Option:
ar: تم التأكيد! الخيار:

# consultationDone
source: Consultation submitted successfully!
ar: تم إرسال الاستشارة بنجاح!

# pleaseUpload
source: Please upload a
ar: يرجى رفع

source: file.
ar: ملف.
